tap "azure/azd"
tap "azure/functions"
tap "bufbuild/buf"
tap "goreleaser/tap"
tap "homebrew/bundle"
tap "jandedobbeleer/oh-my-posh"
tap "kcl-lang/tap"
tap "norwoodj/tap"
tap "yoheimuta/protolint"
brew "act"
brew "argocd"
brew "autojump"
brew "awscli"
brew "azure-cli"
brew "bat"
brew "chezmoi"
brew "difftastic"
brew "direnv"
brew "eza"
brew "fastfetch"
brew "fd"
brew "gcc"
brew "python@3.14"
brew "ffmpeg"
brew "gh"
brew "git"
brew "git-lfs"
brew "git-town"
brew "gitleaks"
brew "glab"
brew "go"
brew "golangci-lint"
brew "gomplate"
brew "grpcui"
brew "grpcurl"
brew "helm"
brew "jq"
brew "k9s"
brew "kind"
brew "kubernetes-cli"
brew "krew"
brew "kubeconform"
brew "kustomize"
brew "lazygit"
brew "neovim"
brew "pipenv"
brew "pipx"
brew "pre-commit"
brew "protolint"
brew "pyenv"
brew "ripgrep"
brew "ruff"
brew "starship"
brew "terraform"
brew "virtualenv"
brew "yq"
brew "yt-dlp"
brew "azure/azd/azd"
brew "azure/functions/azure-functions-core-tools@4"
brew "bufbuild/buf/buf"
brew "jandedobbeleer/oh-my-posh/oh-my-posh"
brew "kcl-lang/tap/kcl-lsp"
brew "kcl-lang/tap/kcl"
brew "norwoodj/tap/helm-docs"
cask "goreleaser"
