tap "ankitpokhrel/jira-cli"
tap "azure/azd"
tap "azure/functions"
tap "bufbuild/buf"
tap "fluxcd/tap"
tap "goreleaser/tap"
tap "grafana/grafana"
tap "jandedobbeleer/oh-my-posh"
tap "kcl-lang/tap"
tap "nikitabobko/tap"
tap "norwoodj/tap"
tap "oven-sh/bun"
tap "yoheimuta/protolint"
brew "act"
brew "argocd"
brew "ca-certificates"
brew "python@3.14"
brew "autojump"
brew "awscli"
brew "python@3.13"
brew "azure-cli"
brew "azure-dev"
brew "bash"
brew "bat"
brew "node"
brew "bitwarden-cli"
brew "chezmoi"
brew "difftastic"
brew "direnv"
brew "eza"
brew "fastfetch"
brew "fd"
brew "ffmpeg"
brew "fish"
brew "fzf"
brew "gcc"
brew "gh"
brew "git"
brew "git-filter-repo"
brew "git-lfs"
brew "git-town"
brew "gitleaks"
brew "glab"
brew "go"
brew "golangci-lint"
brew "gomplate"
brew "grpcui"
brew "grpcurl"
brew "hadolint"
brew "helm"
brew "hugo"
brew "jira-cli"
brew "jq"
brew "just"
brew "k9s"
brew "kind"
brew "kubernetes-cli"
brew "krew"
brew "kubeconform"
brew "kustomize"
brew "lazygit"
brew "markdownlint-cli2"
brew "neovim"
brew "ripgrep"
brew "opencode"
brew "opentofu"
brew "pipenv"
brew "pipx"
brew "podman"
brew "powershell"
brew "pre-commit"
brew "presenterm"
brew "protolint"
brew "pyenv"
brew "python@3.11"
brew "qemu"
brew "ruff"
brew "skopeo"
brew "starship"
brew "tmux"
brew "uv"
brew "virtualenv"
brew "wakatime-cli"
brew "watch"
brew "yq"
brew "yt-dlp"
brew "azure/functions/azure-functions-core-tools@4"
brew "bufbuild/buf/buf"
brew "fluxcd/tap/flux"
brew "jandedobbeleer/oh-my-posh/oh-my-posh"
brew "kcl-lang/tap/kcl-lsp"
brew "kcl-lang/tap/kcl"
brew "norwoodj/tap/helm-docs"
brew "oven-sh/bun/bun"
cask "nikitabobko/tap/aerospace"
cask "bitwarden"
cask "copilot-cli"
cask "dotnet-sdk"
cask "ghostty"
cask "goreleaser/tap/goreleaser"
cask "grafana/grafana/grafana-assistant"
cask "maccy"
vscode "a-h.templ"
vscode "aaron-bond.better-comments"
vscode "aykutsarac.jsoncrack-vscode"
vscode "bierner.markdown-mermaid"
vscode "bmalehorn.vscode-fish"
vscode "bradlc.vscode-tailwindcss"
vscode "charliermarsh.ruff"
vscode "christian-kohler.path-intellisense"
vscode "davidanson.vscode-markdownlint"
vscode "docker.docker"
vscode "donjayamanne.githistory"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "foxundermoon.shell-format"
vscode "github.github-vscode-theme"
vscode "github.vscode-pull-request-github"
vscode "gitlab.gitlab-workflow"
vscode "golang.go"
vscode "gruntfuggly.todo-tree"
vscode "hashicorp.terraform"
vscode "jasonnutter.vscode-codeowners"
vscode "mads-hartmann.bash-ide-vscode"
vscode "mhutchie.git-graph"
vscode "ms-azuretools.vscode-azurefunctions"
vscode "ms-azuretools.vscode-azureresourcegroups"
vscode "ms-azuretools.vscode-bicep"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.powershell"
vscode "njpwerner.autodocstring"
vscode "oderwat.indent-rainbow"
vscode "pkief.material-icon-theme"
vscode "quicktype.quicktype"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer"
vscode "stivo.tailwind-fold"
vscode "tamasfe.even-better-toml"
vscode "tim-koehler.helm-intellisense"
vscode "tomoki1207.pdf"
vscode "unifiedjs.vscode-mdx"
vscode "wakatime.vscode-wakatime"
vscode "wholroyd.jinja"
vscode "yzhang.markdown-all-in-one"
go "github.com/lvlcn-t/azctx"
go "github.com/sigstore/cosign/v3/cmd/cosign"
go "github.com/go-delve/delve/cmd/dlv"
go "mvdan.cc/gofumpt"
go "github.com/golangci/golangci-lint/v2/cmd/golangci-lint"
go "golang.org/x/tools/gopls"
go "github.com/grafana/grafanactl/cmd/grafanactl"
go "github.com/agent-ecosystem/skill-validator/cmd/skill-validator"
krew "ctx"
krew "mc"
krew "ns"
