tap "ankitpokhrel/jira-cli", trusted: true
tap "azure/azd", trusted: true
tap "azure/functions", trusted: true
tap "bufbuild/buf", trusted: true
tap "cloudentity/tap", trusted: true
tap "fluxcd/tap", trusted: true
tap "goreleaser/tap", trusted: true
tap "grafana/grafana", trusted: true
tap "hashicorp/tap"
tap "jandedobbeleer/oh-my-posh", trusted: true
tap "kcl-lang/tap", trusted: true
tap "lvlcn-t/tap", trusted: true
tap "nikitabobko/tap", trusted: true
tap "norwoodj/tap", trusted: true
tap "oven-sh/bun", trusted: true
tap "yoheimuta/protolint", trusted: true
# Run your GitHub Actions locally
brew "act"
# GitOps Continuous Delivery for Kubernetes
brew "argocd"
# Mozilla CA certificate store
brew "ca-certificates"
# Interpreted, interactive, object-oriented programming language
brew "python@3.14"
# Shell extension to jump to frequently used directories
brew "autojump"
# Official Amazon AWS command-line interface
brew "awscli"
# Interpreted, interactive, object-oriented programming language
brew "python@3.13"
# Microsoft Azure CLI 2.0
brew "azure-cli"
# Developer CLI that provides commands for working with Azure resources
brew "azure-dev"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Secure and free password manager for all of your devices
brew "bitwarden-cli"
# Yet another cross-platform graphical process/system monitor
brew "bottom"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# Statistics utility to count lines of code
brew "cloc"
# Diff that understands syntax
brew "difftastic"
# Load/unload environment variables based on $PWD
brew "direnv"
# Modern, maintained replacement for ls
brew "eza"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU compiler collection
brew "gcc"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Quickly rewrite git repository history
brew "git-filter-repo"
# Git extension for versioning large files
brew "git-lfs"
# High-level command-line interface for Git
brew "git-town"
# Audit git repos for secrets
brew "gitleaks"
# Open-source GitLab command-line tool
brew "glab"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Fast linters runner for Go
brew "golangci-lint"
# Command-line Golang template processor
brew "gomplate"
# Interactive web UI for gRPC, along the lines of postman
brew "grpcui"
# Like cURL, but for gRPC
brew "grpcurl"
# Smarter Dockerfile linter to validate best practices
brew "hadolint"
# Kubernetes package manager
brew "helm"
# Configurable static site generator
brew "hugo"
# Feature-rich interactive Jira CLI
brew "jira-cli"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Handy way to save and run project-specific commands
brew "just"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "k9s"
# Run local Kubernetes cluster in Docker
brew "kind"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Package manager for kubectl plugins
brew "krew"
# FAST Kubernetes manifests validator, with support for Custom Resources!
brew "kubeconform"
# Template-free customization of Kubernetes YAML manifests
brew "kustomize"
# Simple terminal UI for git commands
brew "lazygit"
# Fast, flexible, config-based cli for linting Markdown/CommonMark files
brew "markdownlint-cli2"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Programming language with focus on simplicity, performance and modern systems
brew "odin"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# AI coding agent, built for the terminal
brew "opencode"
# Drop-in replacement for Terraform. Infrastructure as Code Tool
brew "opentofu"
# Python dependency management tool
brew "pipenv"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Tool for managing OCI containers and pods
brew "podman"
# Command-line shell and scripting language
brew "powershell"
# Framework for managing multi-language pre-commit hooks
brew "pre-commit"
# Terminal slideshow tool
brew "presenterm"
# Pluggable linter and fixer to enforce Protocol Buffer style and conventions
brew "protolint"
# Python version management
brew "pyenv"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Generic machine emulator and virtualizer
brew "qemu"
# Extremely fast Python linter, written in Rust
brew "ruff"
# Work with remote images registries
brew "skopeo"
# Cross-shell prompt for astronauts
brew "starship"
# Traceroute implementation using TCP packets
brew "tcptraceroute"
# Terminal multiplexer
brew "tmux"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Your CLI home video recorder
brew "vhs"
# Tool for creating isolated virtual python environments
brew "virtualenv"
# Command-line interface to the WakaTime api
brew "wakatime-cli"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Azure Functions Core Tools 4.0
brew "azure/functions/azure-functions-core-tools@4"
# The best way of working with Protocol Buffers.
brew "bufbuild/buf/buf"
# CLI for OAuth2
brew "cloudentity/tap/oauth2c"
# Flux CLI
brew "fluxcd/tap/flux"
# Terraform
brew "hashicorp/tap/terraform", trusted: true
# Prompt theme engine for any shell
brew "jandedobbeleer/oh-my-posh/oh-my-posh"
# A constraint-based record & functional language mainly used in configuration and policy scenarios.
brew "kcl-lang/tap/kcl-lsp"
# KCL Command Line Interface
brew "kcl-lang/tap/kcl"
# Automatically generate markdown documentation for helm charts
brew "norwoodj/tap/helm-docs"
# Incredibly fast JavaScript runtime, bundler, transpiler and package manager - all in one.
brew "oven-sh/bun/bun"
# AeroSpace is an i3-like tiling window manager for macOS
cask "nikitabobko/tap/aerospace"
# Faster way to switch between tenants and subscriptions with az
cask "lvlcn-t/tap/azctx"
# Desktop password and login vault
cask "bitwarden"
# Web browser focusing on privacy
cask "brave-browser"
# Brings the power of Copilot coding agent directly to your terminal
cask "copilot-cli"
# App to build and share containerised applications and microservices
cask "docker-desktop"
# Developer platform
cask "dotnet-sdk"
# Keyboard layout for Europeans, coders, and translators
cask "eurkey-next"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Release engineering, simplified
cask "goreleaser/tap/goreleaser"
# AI assistant for Grafana Cloud
cask "grafana/grafana/grafana-assistant"
# Password manager app
cask "keepassxc"
# Clipboard manager
cask "maccy"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Open-source code editor
cask "visual-studio-code"
go "github.com/lvlcn-t/azctx"
go "github.com/sigstore/cosign/v3/cmd/cosign"
go "github.com/go-delve/delve/cmd/dlv"
go "mvdan.cc/gofumpt"
go "github.com/golangci/golangci-lint/v2/cmd/golangci-lint"
go "golang.org/x/tools/gopls"
go "github.com/grafana/grafanactl/cmd/grafanactl"
go "github.com/agent-ecosystem/skill-validator/cmd/skill-validator"
krew "ctx"
krew "mc"
krew "ns"
