jorgebucaran/fisher
acomagu/fish-async-prompt
patrickf1/fzf.fish
jhillyerd/plugin-git
ahmetb/kubectl-aliases
budimanjojo/tmux.fish
woheedev/onedark-fish
jorgebucaran/nvm.fish
jethrokuan/z
edc/bass
